// #include <iostream>
// using namespace std;
// // برنامه ای بنویسید بطور متوالی ارقام یک عدد ورودی را جمع بزند و مجدد با حاصل جمع همین کار را تکرار کند تا جایی که دیگر امکان جمع دو عدد نباشد.
// int main()
// {
//     long long n, sum;
//     cin >> n; //    یک عدد از کاربر میگیرد
//     do        //    حداقل یکبار انجام میدهد که
//     {
//         sum = 0;      //    هر بار که یک عدد جدید را بررسی میکند با جمع برابر صفر شروع میکند
//         while (n > 0) //    تا زمانیکه عدد هنوز ازبین نرفته و صفر نشده ادامه میدهد
//         {
//             sum += (n % 10); //    رقم یکان را جدا میکند و به جمع اضافه میکند
//             n /= 10;         //    عدد را رفته رفته یک رقم سمت راستش را از بین میبرد
//         }
//         n = sum;       //    عدد جدید را بر اساس جمع قبلی میسازد
//     } while (sum > 9); //    جواب نهایتا عدد یک رقمی باشد
//     cout << sum;       //    جمع نهایی که یک عدد تک رقمی است را چاپ میکند
//     return 0;
// }

#include <iostream>
using namespace std;

int main()
{
    long long n, sum = 0;
    cin >> n;
    while (n)
    {
        sum += n % 10;
        n /= 10;
        if (n == 0)
        {
            n = sum;
            sum = 0;
        }
        cout << sum << "|" << n << "\n";
    }

    return 0;
}